events/Data Storage Events/Metadata.commit/ALERT.KESI.CommitNew.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/kesi</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/"	xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki"	xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>KESI</ns1:sender>
							<ns1:timestamp>10000</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10010</ns1:endTime>
								<ns1:eventName>ALERT.KESI.CommitNew</ns1:eventName>
								<ns1:eventId>5748</ns1:eventId>
								<ns1:eventType>request</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<s:commit>
									<s:commitRepositoryUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Repository1</s:commitRepositoryUri>
									<s:commitRevisionTag>1</s:commitRevisionTag>
									<s:commitAuthor>
										<s:name>Sasa Stojanovic</s:name>
										<s:id>sasa.stojanovic@cimcollege.rs</s:id>
										<s:email>sasa.stojanovic@cimcollege.rs</s:email>
									</s:commitAuthor>
									<s:commitCommitter>
										<s:name>Ivan Obradovic</s:name>
										<s:id>ivan.obradovic@cimcollege.rs</s:id>
										<s:email>ivan.obradovic@cimcollege.rs</s:email>
									</s:commitCommitter>
									<s:commitDate>2012-01-16 16:31</s:commitDate>
									<s:commitMessageLog>comment of commit</s:commitMessageLog>
									<s:commitFile>
										<s:fileId>11111</s:fileId>
										<!-- file action (Add, Copy, Delete, Modify, Rename, Replace) -->
										<s:fileAction>Add</s:fileAction>
                                                                                <s:fileName>filename1</s:fileName>
										<s:fileBranch>branch1</s:fileBranch>
										<s:fileModules>
											<s:moduleId>1111</s:moduleId>
											<s:moduleName>Mod111</s:moduleName>
											<s:moduleStartLine>100</s:moduleStartLine>
											<s:moduleEndLine>199</s:moduleEndLine>
											<s:moduleMethods>
												<s:methodId>111</s:methodId>
												<s:methodName>Meth111</s:methodName>
												<s:methodStartLine>100</s:methodStartLine>
												<s:methodEndLine>149</s:methodEndLine>
											</s:moduleMethods>
											<s:moduleMethods>
												<s:methodId>112</s:methodId>
												<s:methodName>Meth112</s:methodName>
												<s:methodStartLine>150</s:methodStartLine>
												<s:methodEndLine>199</s:methodEndLine>
											</s:moduleMethods>
										</s:fileModules>
										<s:fileModules>
											<s:moduleId>1211</s:moduleId>
											<s:moduleName>Mod1211</s:moduleName>
											<s:moduleStartLine>200</s:moduleStartLine>
											<s:moduleEndLine>299</s:moduleEndLine>
											<s:moduleMethods>
												<s:methodId>121</s:methodId>
												<s:methodName>Meth121</s:methodName>
												<s:methodStartLine>200</s:methodStartLine>
												<s:methodEndLine>299</s:methodEndLine>
											</s:moduleMethods>
										</s:fileModules>
									</s:commitFile>
									<s:commitFile>
										<!-- file action (Add, Copy, Delete, Modify, Rename, Replace) -->
										<s:fileId>21111</s:fileId>
										<s:fileAction>Copy</s:fileAction>
                                                                                <s:fileName>filename2</s:fileName>
										<s:fileBranch>branch2</s:fileBranch>
										<s:fileModules>
											<s:moduleId>2111</s:moduleId>
											<s:moduleName>Mod2111</s:moduleName>
											<s:moduleStartLine>300</s:moduleStartLine>
											<s:moduleEndLine>399</s:moduleEndLine>
											<s:moduleMethods>
												<s:methodId>211</s:methodId>
												<s:methodName>Meth211</s:methodName>
												<s:methodStartLine>300</s:methodStartLine>
												<s:methodEndLine>399</s:methodEndLine>
											</s:moduleMethods>
										</s:fileModules>
									</s:commitFile>
                                                                        <s:commitProduct>
                                                                                <!-- id of commit project -->
                                                                                <s:productId>solid</s:productId>
                                                                                <!-- id of project component -->
                                                                                <s:productComponentId>general</s:productComponentId>
                                                                                <!-- project version -->
                                                                                <s:productVersion>unspecified</s:productVersion>
                                                                        </s:commitProduct>
								</s:commit>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>